brew "autoenv"
brew "bat"
brew "chezmoi"
brew "cowsay"
brew "fzf"
brew "gh"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "luarocks"
brew "neovim"
brew "pyenv"
brew "rbenv"
brew "ripgrep"
brew "swiftformat"
brew "tmux"
brew "uv"
brew "wget"
cask "appcleaner"
cask "charles"
cask "chatgpt-atlas"
cask "codex"
cask "discord"
cask "docker-desktop"
cask "ghostty"
cask "mitmproxy"
cask "ngrok"
cask "slack"
cask "spotify"
cask "telegram"
